# ItemFactoryBase Properties

---
The ItemFactoryBase type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace